app/controllers/currency_quotes_controller.rb

  def new
    @currency_quote = CurrencyQuote.new
    @currency_quote.save
---
INSERT INTO "currency_quotes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-10-01 13:37:56.947492"], ["updated_at", "2017-10-01 13:37:56.947492"]]