app/controllers/exchanges_controller.rb

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @exchanges = Exchange.where(user_id: current_user.id)

INSERT INTO "exchanges" ("base", "target", "amount", "weeks", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["base", "AUD"], ["target", "CHF"], ["amount", "11111.0"], ["weeks", 3], ["created_at", "2017-10-02 20:42:45.611955"], ["updated_at", "2017-10-02 20:42:45.611955"], ["user_id", 1]]
---
  def create
    @exchange = Exchange.new(exchange_params)
    @exchange.user_id = current_user.id

    if @exchange.save

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @exchange = Exchange.find(params[:id])

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "exchanges" SET "target" = $1, "updated_at" = $2 WHERE "exchanges"."id" = $3  [["target", "GBP"], ["updated_at", "2017-10-05 18:13:35.512988"], ["id", 23]]
---
  def update
    @exchange = Exchange.find(params[:id])
    if @exchange.update(exchange_params)

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @exchange = Exchange.find(params[:id])

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "exchanges" WHERE "exchanges"."id" = $1  [["id", 16]]
---
  def destroy
    @exchange = Exchange.find(params[:id])
    @exchange.destroy